Repository: conestack/yafowil.widget.color
Catalog: src/yafowil/widget/color/locales/*/LC_MESSAGES/yafowil.widget.color.po
Languages: de

source: unknown_color_format
de: Unbekanntes Format. Unterstütze Formate: ${formats}

source: incorrect_hex_length
de: Inkorrekter Hex Farbwert: Länge des Wertes muss 7 Zeichen betragen.

source: incorrect_hex8_length
de: Inkorrekter Hex8 Farbwert: Länge des Wertes muss 9 Zeichen betragen.

source: incorrect_hex_value
de: Inkorrekter Hex Farbwert: ${args}

source: unclosed_brace
de: Inkorrekter Farbwert: Ungeschlossene Klammer

source: hsl_str_start
de: Inkorrekter Farbwert: Farbwert muss mit 'hsl' beginnen

source: hsla_str_start
de: Inkorrekter Farbwert: Farbwert muss mit 'hsla' beginnen

source: hsl_str_length
de: Inkorrekter Farbwert: Erwartetes Format: ${hsl_format}

source: hsla_str_length
de: Inkorrekter Farbwert: Erwartetes Format: ${hsla_format}

source: incorrect_hue_value
de: Inkorrekter Farbwert: Wert für Sättigung muss zwischen 0 und 360 liegen.

source: incorrect_saturation_value
de: Inkorrekter Farbwert: Wert für Sättigung muss zwischen 0 und 100 liegen und mit '%' enden.

source: incorrect_lightness_value
de: Inkorrekter Farbwert: Wert für Helligkeit muss zwischen 0 und 100 liegen und mit '%' enden.

source: incorrect_alpha_value
de: Inkorrekter Farbwert: Wert für Alpha muss zwischen 0 und 1 liegen.

source: rgb_str_start
de: Inkorrekter Farbwert: Farbwert muss mit 'rgb' beginnen

source: rgba_str_start
de: Inkorrekter Farbwert: Farbwert muss mit 'rgba' beginnen

source: rgb_str_length
de: Inkorrekter Farbwert: Erwartetes Format: ${rgb_format}

source: rgba_str_length
de: Inkorrekter Farbwert: Erwartetes Format: ${rgba_format}

source: incorrect_red_value
de: Inkorrekter Farbwert: Wert für Rot muss zwischen 0 und 255 liegen.

source: incorrect_green_value
de: Inkorrekter Farbwert: Wert für Grün muss zwischen 0 und 255 liegen.

source: incorrect_blue_value
de: Inkorrekter Farbwert: Wert für Blau muss zwischen 0 und 255 liegen.

source: incorrect_kelvin_format
de: Unbekanntes Format, erwartetes Format: int(1000 - 40000) oder str(1000 - 40000)

source: incorrect_kelvin_number
de: Kelvin Temperatur außerhalb des gültigen Bereichs (1000-40000)
